# 5)შექმენით რიცხვების სია სადაც იქნება 5 რიცხვი, შემდეგ მომხმარებელს შემოატანინეთ მისი საყვარელი რიცხვი და ასევე ინდექსი, საბოლოოდ ამ შემოტანილ ინდექსზე ჩაამატეთ მისი საყვარელი რიცხვი (შეამოწმეთ რომ ინდექსი იყოს ვალიდური (ანუ არ უნდა ცდებოდეს სიის ინდექსებს (მაგ: თუ სიაში არის მაქსიმალური ინდექსი 5 და მომხმარებელმა შემოიტანა 100, მაშინ დაუპრინტეთ invalid index)))
numbers = [10, 20, 30, 40, 50]
favorite_number = int(input("შეიყვანეთ თქვენი საყვარელი რიცხვი: "))
index = int(input("შეიყვანეთ ინდექსი, სადაც გსურთ თქვენი საყვარელი რიცხვის დამატება: "))
if 0 <= index < len(numbers):
    numbers.insert(index, favorite_number)
    print(numbers)      