# 4)პითონის გაშვების გარეშე კომენტარის სახით დაწერე რას გამოიტანს თითოეული პრინტი
# A = {1, 2, 3, 4} B = {3, 4, 5, 6}

# print(A.intersection(B))
# print(A.union(B))
# print(A.difference(B))
# print(A.symmetric_difference(B))

# A.intersection(B) გამოიტანს {3, 4} რადგან ეს ორი ელემენტი ორივე სეტშია
# A.union(B) გამოიტანს {1, 2, 3, 4, 5, 6} რადგან ეს არის ორივე სეტის გაერთიანება
# A.difference(B) გამოიტანს {1, 2} რადგან ეს ელემენტები არის A სეტში მაგრამ არა B სეტში
# A.symmetric_difference(B) გამოიტანს {1, 2, 5, 6} რადგან ეს ელემენტები არის ან A სეტში ან B სეტში, მაგრამ არა ორივეში