# 5)შექმენი რაიმე სია და მომხმარებელს შემოატანინე n რიცხვი 1-5 დიაპაზონში, შემდეგ კი გამოიტანე ამ სიაში ყველა n რიგის რიცხვი (მაგალითად, სიაში [1,2,3,4,5,6] თუ მომხმარებელმა შემოიტანა 2, შენ გამოიტან [2,4,6])
my_list = [1, 2, 3, 4, 5, 6]
n = int(input("შეიყვანეთ n რიცხვი (1-5): "))
if 1 <= n <= 5:
    result = []
    for i in range(n - 1, len(my_list), n):
        result.append(my_list[i])
    print("ამ სიაში ყველა n რიგის რიცხვი:", result)
else:
    print("შეტანილი n რიცხვი არასწორია. შემოიტანეთ რიცხვი 1-5 დიაპაზონში.")